---@type number
last_version = 13

---@type PatchNotes[]
gamePatches = {
	{
        version = 13,
        name = "Storm",
        patchnoteUrl = "balances/11.html",
        description = {
            "# Баг фикс 13 (10 апреля 2026)",
            "",
            "★«Шторм» Баг фикс",
            "Баланс-команда: LIN,Armagedon,Angel_Fugu.",
        }
	},
	{
        version = 12,
        name = "Storm",
        patchnoteUrl = "balances/11.html",
        description = {
            "# Баг фикс 12 (21 марта 2026)",
            "",
            "★«Шторм» Представляет собой Корректирование юнитов",
			"★Полный список изменений – на сайте. Нажмите на кнопку \"Описание патча\" (Patch info).",
            "Баланс-команда: LIN,Armagedon,Angel_Fugu.",
        }
	},
    {
        version = 11,
        name = "Storm",
        patchnoteUrl = "balances/11.html",
        description = {
            "# Баланс-патч 11 (21 марта 2026)",
            "",
            "★«Шторм» Представляет собой Корректирование юнитов",
			"★Полный список изменений – на сайте. Нажмите на кнопку \"Описание патча\" (Patch info).",
            "Баланс-команда: LIN,Armagedon,Angel_Fugu.",
        }
    },
    {
        version = 10,
        name = "Royal times",
        patchnoteUrl = "balances/10.html",
        description = {
            "# Баланс-патч 10 (4 февраля 2026)",
            "",
            "★«Начало новых времен» Представляет собой Корректирование юнитов",
            "★Нерф снайперов.",
            "★Откат фетбоя.",
            "★Изменения Эон дезинтегратора щитов.",
			"★Полный список изменений – на сайте. Нажмите на кнопку \"Описание патча\" (Patch info).",
            "Баланс-команда: LIN,Armagedon,Angel_Fugu.",
        }
    },
    {
        version = 9,
        name = "Royal times",
        patchnoteUrl = "balances/9.html",
        description = {
            "# Баланс-патч 9 (29 декабрь 2025)",
            "",
            "★«Королевские времена» представляет собой, оживление утраченных тактик и возможностей (всё интересное новое ,это давно забытое старое",
            "★Нерф снайперов.",
            "★Ребаланс фетбоя.",
            "★Изменения Эон лодки пво.",
			"★Полный список изменений – на сайте. Нажмите на кнопку \"Описание патча\" (Patch info).",
            "Баланс-команда: LIN, Aiverse,Armagedon,Angel_Fugu.",
        }
    },
    {
        version = 8,
        name = "Reboot",
        patchnoteUrl = "balances/1.8.html",
        description = {
            "# Баланс-патч 1.8 (30 октября 2025)",
            "",
            "★Откат к базовому балансу с точечными правками!",
            "★Баф снайперов.",
            "★Ребаланс T2 танков.",
            "★Изменения ACU и Sacu.",
			"★Изменения визуально HQ зданий, морских и воздушных юнитов.",
			"★Полный список изменений – на сайте. Нажмите на кнопку \"Описание патча\" (Patch info).",
            "Баланс-команда: LIN, Angel_Fugu.",
        }
    },
    {
        version = 7,
        name = "Aeonigma",
        patchnoteUrl = "balances/7.html",
        description = {
            "# Баланс-патч 7 (30 апреля 2025)",
            "",
            "★ БМК ОФЗ: новый ган и щит для лейта. Дороже дроны.",
            "★ БМК Эон: Хроно замедляет вместо стана. Слоты упрощены.",
            "★ БМК Кибран: лазер вернули, РАС теперь в руке.",
            "",
            "★ Обсидиан (T2 Ленд Эон): уменьшен сплеш.",
            "★ Яшавох (T2 Ленд Серафим): уменьшен сплеш.",
            "★ Вагнер (T2 Ленд Кибран): апнут, торпеды быстрее, есть стелс.",
            "",
            "★ Геспер (T2 Подлодка Эон): снижены радиусы анти-торпеды.",
            "★ Барракуда (T2 Подлодка Кибран): ребаланс анти-торпедной системы.",
            "★ Ятсу (T3 Подлодка Серафим): снижены урон и залп, улучшена торпедная защита.",
            "",
            "★ Фигляр (T1 Штурмовик Кибран): подешевел, стал быстрее, но менее живуч.",
            "★ Командирский дрон: дороже, быстрее, живучее.",
            "",
            "★ Скатис: меньше залп, выше урон, быстрее передвигается.",
            "",
            "★ Темпест (Буря): фикс потери выстрела при смене цели.",
            "★ Паук: быстрее, маневреннее, сплеш 1.",
            "★ Итота: нерф реверса, снижена мобильность.",
            "★ Колосс: усилены притяжка, дальность, сплеш.",
            "",
            "Полный список изменений – на сайте. Нажмите на кнопку \"Описание патча\" (Patch info).",
            "",
            "Баланс-команда: Isakentyi, Angel и Sticky",
        }
    },
    {
        version = 6,
        name = "Cerberus reborn",
        hasPrettyGithubRelease = true,
        description = {
            "# Баланс-патч 1.5 (14 апреля 2025)",
            "",
            "Основные изменения: переработаны корсары, апнуты Т3 ганшипы.",
            "Обновлён Т3 ММЛ ОФЗ.",
            "Атлантис апнули!",
            "Переработана Т2 ПВО Кибрана и другие ПВО.",
            "Полный список изменений – на сайте. Нажмите на кнопку \"Описание патча\" (Patch info).",
            "",
            "Balance Team",
            "",
            "Isakentyi, SupremeKiska, Gary_Goodspeed, Angel_fugu и Sticky",
        }
    },
    {
        version = 5,
        name = "New Luntic",
        hasPrettyGithubRelease = true,
        description = {
            "# Баланс-патч 1.4 (28 февраля 2025)",
            "",
            "На этот раз мы перебалансировали все 'Геи', Т3 артиллерию.",
            "Исправлены баги, добавлены особенности некоторым юнитам.",
            "И сегодня дебютирует наш новый юнит!",
            "Полный список изменений – на сайте. Нажмите на кнопку \"Описание патча\" (Patch info).",
            "",
            "Balance Team",
            "",
            "Isakentyi, SupremeKiska, Gary_Goodspeed и Angel_fugu",
        }
    },
    {
        version = 4,
        name = "Fixable",
        hasPrettyGithubRelease = true,
        description = {
            "# Баланс-патч 1.3 (17 февраля 2025)",
            "",
            "В этом патче мы исправили юниты, которые стали имбой, и уравняли время смерти у всех факторок.",
            "Добавлены новые фишки для повышения комфорта игры.",
            "Полный список изменений – на сайте. Нажмите на кнопку \"Описание патча\" (Patch info).",
            "",
            "Balance Team",
            "",
            "Isakentyi, SupremeKiska и Gary_Goodspeed",
        }
    },
    {
        version = 3,
        name = "Cybran tears",
        hasPrettyGithubRelease = true,
        description = {
            "# Баланс-патч 1.2 (31 января 2025)",
            "",
            "Мы переделали Т3 наземные юниты и крейсеры, исправили ховеры и другие мелочи.",
            "Долгое время мы наблюдали, как на миду сражались Персивали и Кирпичи.",
            "Остальные Т3-юниты погибали почти мгновенно.",
            "Этим патчем мы попытались это исправить, вернув в сетап снайперов.",
            "Если найдёте баг — напишите в Discord на сервере GapForever.com.",
            "Понерфили Кирпичей, апнули Тапки и Пузыри, переделали Т3 мобильную артиллерию.",
            "Для подробностей – нажмите на кнопку \"Описание патча\" (Patch info).",
            "",
            "Balance Team",
            "Isakentyi, SupremeKiska и Gary_Goodspeed",
        }
    },
    {
        version = 2,
        name = "GAP Balance",
        hasPrettyGithubRelease = true,
        description = {
            "# Баланс-патч 1.1 (26 января 2025)",
            "",
            "Изменения коснулись Т2 наземных войск и флота. Подробности — на странице Patchnotes.",
            "",
            "Если найдёте баг — напишите в Discord на сервере GapForever.com.",
            "",
            "Isakentyi и SupremeKiska",
        }
    },
    {
        version = 1,
        name = "GAP Balance",
        hasPrettyGithubRelease = true,
        description = {
            "# Баланс-патч 1.0 (20 января 2025)",
            "",
            "Изменения затронули Т1 наземку, Скатиса и авиацию. Подробности — на странице Patchnotes.",
            "",
            "Если найдёте баг — напишите в Discord на сервере GapForever.com.",
            "",
            "Isakentyi и SupremeKiska",
        }
    },
}
