options = 
{
	{ 
		default = 2, 
		label = "Усиление", 
		help = "Включить усиление?", 
		key = 'Mod', 
		pref = 'DFF', 
		values = { 
			{text = "да", help = "Да включить. (добавляет доп хп бмк при старте. + Бот если игрок 1)", key = 1, }, 
			{text = "нет", help = "Нет, без усиления", key = 2, }, 
		}, 
	},
	{ 
		default = 2, 
		label = "Кошмарная ", 
		help = "Включить Кошмарную сложность?", 
		key = 'Dif4', 
		pref = 'CDS', 
		values = { 
			{text = "да", help = "Да включить. (Условие: должна быть включенная сложная сложность)", key = 1, }, 
			{text = "нет", help = "Нет, не желаем купатся в лаве ада", key = 2, }, 
		}, 
	}, 
};